; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-1-3)
(:domain sobokosnake)
(:objects
    pos0-5 - location
    pos0-6 - location
    pos1-1 - location
    pos1-2 - location
    pos1-3 - location
    pos1-5 - location
    pos1-6 - location
    pos2-0 - location
    pos2-1 - location
    pos2-2 - location
    pos2-3 - location
    pos2-4 - location
    pos2-5 - location
    pos2-6 - location
    pos3-1 - location
    pos3-2 - location
    pos3-3 - location
    pos3-5 - location
    pos3-6 - location
    pos4-5 - location
    pos4-6 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-5 pos0-6 dir-right)
    (MOVE-DIR pos0-5 pos1-5 dir-down)
    (MOVE-DIR pos0-6 pos0-5 dir-left)
    (MOVE-DIR pos0-6 pos1-6 dir-down)
    (MOVE-DIR pos1-1 pos1-2 dir-right)
    (MOVE-DIR pos1-1 pos2-1 dir-down)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-2 pos1-1 dir-left)
    (MOVE-DIR pos1-2 pos2-2 dir-down)
    (MOVE-DIR pos1-3 pos2-3 dir-down)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos1-5 pos1-6 dir-right)
    (MOVE-DIR pos1-5 pos2-5 dir-down)
    (MOVE-DIR pos1-5 pos0-5 dir-up)
    (MOVE-DIR pos1-6 pos1-5 dir-left)
    (MOVE-DIR pos1-6 pos2-6 dir-down)
    (MOVE-DIR pos1-6 pos0-6 dir-up)
    (MOVE-DIR pos2-0 pos2-1 dir-right)
    (MOVE-DIR pos2-1 pos2-2 dir-right)
    (MOVE-DIR pos2-1 pos2-0 dir-left)
    (MOVE-DIR pos2-1 pos1-1 dir-up)
    (MOVE-DIR pos2-1 pos3-1 dir-down)
    (MOVE-DIR pos2-2 pos2-1 dir-left)
    (MOVE-DIR pos2-2 pos1-2 dir-up)
    (MOVE-DIR pos2-2 pos2-3 dir-right)
    (MOVE-DIR pos2-2 pos3-2 dir-down)
    (MOVE-DIR pos2-3 pos2-2 dir-left)
    (MOVE-DIR pos2-3 pos2-4 dir-right)
    (MOVE-DIR pos2-3 pos1-3 dir-up)
    (MOVE-DIR pos2-3 pos3-3 dir-down)
    (MOVE-DIR pos2-4 pos2-3 dir-left)
    (MOVE-DIR pos2-4 pos2-5 dir-right)
    (MOVE-DIR pos2-5 pos2-6 dir-right)
    (MOVE-DIR pos2-5 pos2-4 dir-left)
    (MOVE-DIR pos2-5 pos1-5 dir-up)
    (MOVE-DIR pos2-5 pos3-5 dir-down)
    (MOVE-DIR pos2-6 pos2-5 dir-left)
    (MOVE-DIR pos2-6 pos1-6 dir-up)
    (MOVE-DIR pos2-6 pos3-6 dir-down)
    (MOVE-DIR pos3-1 pos3-2 dir-right)
    (MOVE-DIR pos3-1 pos2-1 dir-up)
    (MOVE-DIR pos3-2 pos3-3 dir-right)
    (MOVE-DIR pos3-2 pos3-1 dir-left)
    (MOVE-DIR pos3-2 pos2-2 dir-up)
    (MOVE-DIR pos3-3 pos2-3 dir-up)
    (MOVE-DIR pos3-3 pos3-2 dir-left)
    (MOVE-DIR pos3-5 pos3-6 dir-right)
    (MOVE-DIR pos3-5 pos2-5 dir-up)
    (MOVE-DIR pos3-5 pos4-5 dir-down)
    (MOVE-DIR pos3-6 pos3-5 dir-left)
    (MOVE-DIR pos3-6 pos2-6 dir-up)
    (MOVE-DIR pos3-6 pos4-6 dir-down)
    (MOVE-DIR pos4-5 pos4-6 dir-right)
    (MOVE-DIR pos4-5 pos3-5 dir-up)
    (MOVE-DIR pos4-6 pos4-5 dir-left)
    (MOVE-DIR pos4-6 pos3-6 dir-up)
    (thinsnake pos2-1)
    (blocked pos2-1)
    (ispoint pos1-1)
    (ispoint pos1-3)
    (ispoint pos1-5)
    (ispoint pos2-0)
    (ispoint pos2-2)
    (ispoint pos2-4)
    (ispoint pos2-6)
    (ispoint pos3-1)
    (ispoint pos3-3)
    (ispoint pos3-5)
)
(:goal
(and
    (not (ispoint pos1-1))
    (not (ispoint pos1-3))
    (not (ispoint pos1-5))
    (not (ispoint pos2-0))
    (not (ispoint pos2-2))
    (not (ispoint pos2-4))
    (not (ispoint pos2-6))
    (not (ispoint pos3-1))
    (not (ispoint pos3-3))
    (not (ispoint pos3-5))
)
)
)

; plan
1. (move-thin-snake-and-first-eat pos2-1 pos1-1 dir-up)
   deleted: (ispoint pos1-1) (thinsnake pos2-1)
   added: (blocked pos1-1) (headsnake pos1-1) (tailsnake pos2-1) (nextsnake pos1-1 pos2-1)
   goals met: 1 of 10
2. (move-fat-snake pos1-1 pos1-2 pos2-1 pos1-1 dir-right)
   deleted: (headsnake pos1-1) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos1-1 pos2-1)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-1) (tailsnake pos1-1)
   goals met: 1 of 10
3. (move-and-eat pos1-2 pos2-2 dir-down)
   deleted: (headsnake pos1-2) (ispoint pos2-2)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos1-2)
   goals met: 2 of 10
4. (move-fat-snake pos2-2 pos3-2 pos1-1 pos1-2 dir-down)
   deleted: (headsnake pos2-2) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-2 pos1-1)
   added: (blocked pos3-2) (headsnake pos3-2) (nextsnake pos3-2 pos2-2) (tailsnake pos1-2)
   goals met: 2 of 10
5. (move-and-eat pos3-2 pos3-3 dir-right)
   deleted: (headsnake pos3-2) (ispoint pos3-3)
   added: (blocked pos3-3) (headsnake pos3-3) (nextsnake pos3-3 pos3-2)
   goals met: 3 of 10
6. (move-fat-snake pos3-3 pos2-3 pos1-2 pos2-2 dir-up)
   deleted: (headsnake pos3-3) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos2-2 pos1-2)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos3-3) (tailsnake pos2-2)
   goals met: 3 of 10
7. (move-and-eat pos2-3 pos2-4 dir-right)
   deleted: (headsnake pos2-3) (ispoint pos2-4)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-3)
   goals met: 4 of 10
8. (move-fat-snake pos2-4 pos2-5 pos2-2 pos3-2 dir-right)
   deleted: (headsnake pos2-4) (blocked pos2-2) (tailsnake pos2-2) (nextsnake pos3-2 pos2-2)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos2-4) (tailsnake pos3-2)
   goals met: 4 of 10
9. (move-and-eat pos2-5 pos1-5 dir-up)
   deleted: (headsnake pos2-5) (ispoint pos1-5)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos2-5)
   goals met: 5 of 10
10. (move-fat-snake pos1-5 pos0-5 pos3-2 pos3-3 dir-up)
   deleted: (headsnake pos1-5) (blocked pos3-2) (tailsnake pos3-2) (nextsnake pos3-3 pos3-2)
   added: (blocked pos0-5) (headsnake pos0-5) (nextsnake pos0-5 pos1-5) (tailsnake pos3-3)
   goals met: 5 of 10
11. (move-fat-snake pos0-5 pos0-6 pos3-3 pos2-3 dir-right)
   deleted: (headsnake pos0-5) (blocked pos3-3) (tailsnake pos3-3) (nextsnake pos2-3 pos3-3)
   added: (blocked pos0-6) (headsnake pos0-6) (nextsnake pos0-6 pos0-5) (tailsnake pos2-3)
   goals met: 5 of 10
12. (move-fat-snake pos0-6 pos1-6 pos2-3 pos2-4 dir-down)
   deleted: (headsnake pos0-6) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos2-4 pos2-3)
   added: (blocked pos1-6) (headsnake pos1-6) (nextsnake pos1-6 pos0-6) (tailsnake pos2-4)
   goals met: 5 of 10
13. (move-and-eat pos1-6 pos2-6 dir-down)
   deleted: (headsnake pos1-6) (ispoint pos2-6)
   added: (blocked pos2-6) (headsnake pos2-6) (nextsnake pos2-6 pos1-6)
   goals met: 6 of 10
14. (move-fat-snake pos2-6 pos3-6 pos2-4 pos2-5 dir-down)
   deleted: (headsnake pos2-6) (blocked pos2-4) (tailsnake pos2-4) (nextsnake pos2-5 pos2-4)
   added: (blocked pos3-6) (headsnake pos3-6) (nextsnake pos3-6 pos2-6) (tailsnake pos2-5)
   goals met: 6 of 10
15. (move-fat-snake pos3-6 pos4-6 pos2-5 pos1-5 dir-down)
   deleted: (headsnake pos3-6) (blocked pos2-5) (tailsnake pos2-5) (nextsnake pos1-5 pos2-5)
   added: (blocked pos4-6) (headsnake pos4-6) (nextsnake pos4-6 pos3-6) (tailsnake pos1-5)
   goals met: 6 of 10
16. (move-fat-snake pos4-6 pos4-5 pos1-5 pos0-5 dir-left)
   deleted: (headsnake pos4-6) (blocked pos1-5) (tailsnake pos1-5) (nextsnake pos0-5 pos1-5)
   added: (blocked pos4-5) (headsnake pos4-5) (nextsnake pos4-5 pos4-6) (tailsnake pos0-5)
   goals met: 6 of 10
17. (move-and-eat pos4-5 pos3-5 dir-up)
   deleted: (headsnake pos4-5) (ispoint pos3-5)
   added: (blocked pos3-5) (headsnake pos3-5) (nextsnake pos3-5 pos4-5)
   goals met: 7 of 10
18. (move-fat-snake pos3-5 pos2-5 pos0-5 pos0-6 dir-up)
   deleted: (headsnake pos3-5) (blocked pos0-5) (tailsnake pos0-5) (nextsnake pos0-6 pos0-5)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos3-5) (tailsnake pos0-6)
   goals met: 7 of 10
19. (move-fat-snake pos2-5 pos2-4 pos0-6 pos1-6 dir-left)
   deleted: (headsnake pos2-5) (blocked pos0-6) (tailsnake pos0-6) (nextsnake pos1-6 pos0-6)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-5) (tailsnake pos1-6)
   goals met: 7 of 10
20. (move-fat-snake pos2-4 pos2-3 pos1-6 pos2-6 dir-left)
   deleted: (headsnake pos2-4) (blocked pos1-6) (tailsnake pos1-6) (nextsnake pos2-6 pos1-6)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos2-4) (tailsnake pos2-6)
   goals met: 7 of 10
21. (move-and-eat pos2-3 pos1-3 dir-up)
   deleted: (headsnake pos2-3) (ispoint pos1-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos2-3)
   goals met: 8 of 10
22. (move-fat-snake pos1-3 pos1-2 pos2-6 pos3-6 dir-left)
   deleted: (headsnake pos1-3) (blocked pos2-6) (tailsnake pos2-6) (nextsnake pos3-6 pos2-6)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-3) (tailsnake pos3-6)
   goals met: 8 of 10
23. (move-fat-snake pos1-2 pos2-2 pos3-6 pos4-6 dir-down)
   deleted: (headsnake pos1-2) (blocked pos3-6) (tailsnake pos3-6) (nextsnake pos4-6 pos3-6)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos1-2) (tailsnake pos4-6)
   goals met: 8 of 10
24. (move-fat-snake pos2-2 pos3-2 pos4-6 pos4-5 dir-down)
   deleted: (headsnake pos2-2) (blocked pos4-6) (tailsnake pos4-6) (nextsnake pos4-5 pos4-6)
   added: (blocked pos3-2) (headsnake pos3-2) (nextsnake pos3-2 pos2-2) (tailsnake pos4-5)
   goals met: 8 of 10
25. (move-and-eat pos3-2 pos3-1 dir-left)
   deleted: (headsnake pos3-2) (ispoint pos3-1)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos3-2)
   goals met: 9 of 10
26. (move-fat-snake pos3-1 pos2-1 pos4-5 pos3-5 dir-up)
   deleted: (headsnake pos3-1) (blocked pos4-5) (tailsnake pos4-5) (nextsnake pos3-5 pos4-5)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos3-1) (tailsnake pos3-5)
   goals met: 9 of 10
27. (move-and-eat pos2-1 pos2-0 dir-left)
   deleted: (headsnake pos2-1) (ispoint pos2-0)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos2-1)
   goals met: 10 of 10
